Revit 2027 API
BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTag Property
 Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementCategoryChangeInvalidatesTag { get; }
Public Shared ReadOnly Property ElementCategoryChangeInvalidatesTag As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementCategoryChangeInvalidatesTag {
	FailureDefinitionId^ get ();
}
static member ElementCategoryChangeInvalidatesTag : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TagFailures Class
Autodesk.Revit.DB Namespace